---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetColoredSurfaceSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings)
source: html/40616a4b-f378-83e8-33fe-e3267694d11d.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetColoredSurfaceSettings Method

Set colored surface settings object for the style.

## Syntax (C#)
```csharp
public void SetColoredSurfaceSettings(
	AnalysisDisplayColoredSurfaceSettings coloredSurfaceSettings
)
```

## Parameters
- **coloredSurfaceSettings** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayColoredSurfaceSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - colored surface settings were not created with the object.